[
  {
    "abstract": "H. pylori is a Gram-negative, spiral shaped microaerophile pathogen which is colonized in more than half of the world population's stomach. It is a major cause of gastritis associated disease like gastritis, gastric ulcer, duodenal ulcer, gastric adenocarcinoma, mucosa associated lymphoid tissue lymphoma (MALT lymphoma). Genetic diversity within the virulence genes of bacteria such as Cytotoxin associated gene Pathogenicity Island (cagPAI) and vacuolating cytotoxinA (vacA) may have a modifying effect on the pathogenic potential of the infecting strain. This study aimed to investigate which genes can be suggested as potentially related virulence factors for H. pylori associated active chronic gastritis and stomach Adenocarcinoma in Iran and Turkey. We focused on some cag (PAI) components and vacA gene subtypes based on correlations shown in some previous studies and Formalin Fixed Paraffin Embedded (FFPE) tissues obtained from Iranian and Turkish patients. The prevalence of the cagA, cagE, cagT, cagG, cagM, vacA s1a, vacA s2, vacA m1 and vacA m2 genes were studied in these strains by using the polymerase chain reaction (PCR) method and specific primers and We found that vacAs1a, vacAm2 and cagA genes with mean prevalence of 82.41%, 71.42% and 69.23% were dominant in Iranian and Turkish patients. In conclusion in Turkish and Iranian population the genes that were studied, was homogeneous and there is no significant differences in bacterial genetic and with the exception of H. pylori infection other factors such as host genetics and nourishment play an important role in the formation of gastric cancer. But it is possible that if statistical population increases, the cagA gene association with cancer will be meaningful.",
    "source": "https://tez.yok.gov.tr/UlusalTezMerkezi/tezSorguSonucYeni.jsp",
    "details": "Investigation of the effect of diabetes mellitus on Sydney classification parameters used in chronic gastritis caused by Helicobacter Pylori infection"
  }
]
