[
  {
    "abstract": "The relationship between Helicobacter Pylori and diabetes mellitus was suggested in 1989 at first. Subsequently, different studies were conducted on the relationship between Helicobacter Pylori and diabetes. The pathological classification of gastritis caused by Helicobacter Pylori, which is so common in almost all parts of the world, is made according to the Sydney classification. The Sydney system facilitated the documentation of microscopic training in terms of chronic gastritis. The aim of this study is to determine whether diabetes has an effect on the Sydney classification parameters which used in the evaluation of chronic gastritis caused by Helicobacter Pylori infection. This studiy is retrospective. Patients over the age of 18 who had endoscopy were divided into two groups, diabetic and non-diabetic, according to the hospital information management system. Those whose fasting blood glucose is more than 126 two times, HbA1c value is above 6.5, diagnosed with diabetes in the system records and/or those who have diabetes mellitus register in their clinical follow-up notes as comorbidity information, were classified as the diabetic group. Those whose HbA1c value was below 6.5 and who did not have a diagnosis or history of diabetes in their system registers and those who did not register diabetes mellitus in the comorbidity information in their clinical follow-up notes were classified as the non-diabetic group. Moreover, gender, age, insulin use and the Sydney classification parameters were scanned according to the hospital information management system. Those for whom sufficient data could not be obtained in the hospital information management system were not included in the study. In addition, in the regression analysis, it was found that the probability of Helicobacter Pylori density being in density 3 in diabetic patients over 65 years of age was approximately 5 times higher than the probability of being in density 1. There was no difference between diabetic and nondiabetic patients in terms of the presence and intensities of chronic inflammation, neutrophil activation, atrophy and intestinal metaplasia. There was no statistically significant relationship between insulin use and Helicobacter Pylori colonization density in diabetic patients. In diabetic patients, no relationship could be detected between insulin use and chronic inflammation, neutrophil activation, atrophy and intestinal metaplasia. Although there was no significant difference between Helicobacter Pylori positive diabetic and nondiabetic patients according to histopathological findings, Helicobacter Pylori density was found higher in diabetic patients when only the geriatric age group was considered.",
    "source": "https://tez.yok.gov.tr/UlusalTezMerkezi/tezSorguSonucYeni.jsp",
    "details": "Investigation of the effect of diabetes mellitus on Sydney classification parameters used in chronic gastritis caused by Helicobacter Pylori infection"
  }
]
